modm-ext/data.modm.io/docs/svd/header_stm32f303xc.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP5</name>
      <description>Analog Comparators</description>
      <baseAddress>0x4001002c</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMP5EN</name>
              <description>COMP5 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP5MODE</name>
              <description>COMP5 power mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP5INSEL</name>
              <description>COMP5 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP5NONINSEL</name>
              <description>COMP5 non inverting input select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP5OUTSEL</name>
              <description>COMP5 output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>COMP5POL</name>
              <description>COMP5 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP5HYST</name>
              <description>COMP5 hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP5BLANKING</name>
              <description>COMP5 blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP5OUT</name>
              <description>COMP5 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP5LOCK</name>
              <description>COMP5 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="COMP12_COMMON">
      <name>COMP56_COMMON</name>
      <baseAddress>0x40010030</baseAddress>
    </peripheral>
    <peripheral>
      <name>COMP6</name>
      <description>Analog Comparators</description>
      <alternatePeripheral>COMP56_COMMON</alternatePeripheral>
      <baseAddress>0x40010030</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMP6EN</name>
              <description>COMP6 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP6MODE</name>
              <description>COMP6 power mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP6INSEL</name>
              <description>COMP6 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP6NONINSEL</name>
              <description>COMP6 non inverting input select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP6WNDWEN</name>
              <description>COMP6 window mode enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP6OUTSEL</name>
              <description>COMP6 output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>COMP6POL</name>
              <description>COMP6 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP6HYST</name>
              <description>COMP6 hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP6BLANKING</name>
              <description>COMP6 blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP6OUT</name>
              <description>COMP6 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP6LOCK</name>
              <description>COMP6 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP7</name>
      <description>Analog Comparators</description>
      <baseAddress>0x40010034</baseAddress>
      <interrupt>
        <name>COMP7</name>
        <description>COMP7 global Interrupt via EXTI Line33</description>
        <value>66</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMP7EN</name>
              <description>COMP7 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP7MODE</name>
              <description>COMP7 power mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP7INSEL</name>
              <description>COMP7 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP7NONINSEL</name>
              <description>COMP7 non inverting input select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP7OUTSEL</name>
              <description>COMP7 output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>COMP7POL</name>
              <description>COMP7 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP7HYST</name>
              <description>COMP7 hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP7BLANKING</name>
              <description>COMP7 blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP7OUT</name>
              <description>COMP7 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP7LOCK</name>
              <description>COMP7 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
